{
    "OoGfRH-vq4w": "hey guys welcome to todays workshop in todays workshop i will be explaining mongoDB from scratch so before moving on , let's clear the agenda of today's session. In today's session we will learn about the overview of NoSQL databases. We will learn about CRUD operations that will be used for manipulation, that includes Create, Read, Update, and Delete commands. Then we have aggregation; in aggregation we will learn about the commands such as count, distinct, and many more. Then we'll move forward towards indexing.Which is one of the most important concepts of MongoDB. So at first, I would like to know if you know about databases or not. Can you ping me on the chat window what is a database? Anyone? You can comment in the live chat. Exactly! A database is a collection of records, a collection of data that is interrelated to each other. It could be a record of students, a record of employees, or a record of hostel information. So databases are of two types: SQL database and NoSQL database. SQL database is basically a relational database; it is in the format of a table. For example, an Excel sheet. In an Excel sheet, we have rows and columns. Similarly, in SQL databases, we have rows and columns which have a rigid structure and limited storage.Which is one of the most important concepts of MongoDB. So at first, I would like to know if you know about databases or not. Can you ping me on the chat window what is a database? Anyone? You can comment in the live chat. Exactly! A database is a collection of records, a collection of data that is interrelated to each other. It could be a record of students, a record of employees, or a record of hostel information. So databases are of two types: SQL database and NoSQL database. SQL database is basically a relational database; it is in the format of a table. For example, an Excel sheet. In an Excel sheet, we have rows and columns. Similarly, in SQL databases, we have rows and columns which have a rigid structure and limited storagWhich is one of the most important concepts of MongoDB. So at first, I would like to know if you know about databases or not. Can you ping me on the chat window what is a database? Anyone? You can comment in the live chat. Exactly! A database is a collection of records, a collection of data that is interrelated to each other. It could be a record of students, a record of employees, or a record of hostel information. So databases are of two types: SQL database and NoSQL database. SQL database is basically a relational database; it is in the format of a table. For example, an Excel sheet. In an Excel sheet, we have rows and columns. Similarly, in SQL databases, we have rows and columns which have a rigid structure and limited storagWhich is one of the most important concepts of MongoDB. So at first, I would like to know if you know about databases or not. Can you ping me on the chat window what is a database? Anyone? You can comment in the live chat. Exactly! A database is a collection of records, a collection of data that is interrelated to each other. It could be a record of students, a record of employees, or a record of hostel information. So databases are of two types: SQL database and NoSQL database. SQL database is basically a relational database; it is in the format of a table. For example, an Excel sheet. In an Excel sheet, we have rows and columns. Similarly, in SQL databases, we have rows and columns which have a rigid structure and limited storagWhich is one of the most important concepts of MongoDB. So at first, I would like to know if you know about databases or not. Can you ping me on the chat window what is a database? Anyone? You can comment in the live chat. Exactly! A database is a collection of records, a collection of data that is interrelated to each other. It could be a record of students, a record of employees, or a record of hostel information. So databases are of two types: SQL database and NoSQL database. SQL database is basically a relational database; it is in the format of a table. For example, an Excel sheet. In an Excel sheet, we have rows and columns. Similarly, in SQL databases, we have rows and columns which have a rigid structure and limited storage"

}